<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>포마이펫 회원가입 약관</title>
<style>

  /* 회원가입 약관 */
  .contract {
      width: 700px; 
      margin: 0px auto 80px; 
      padding: 30px 40px 50px;
      border-radius: 30px; 
  }
  .contract h2 {text-align: center;}
  .contract .text, .contract .text2 {
      height: 230px; 
      border: 1px solid black; 
      background-color: white;
      white-space: pre-line; 
      overflow-y: scroll; 
      margin: 0 auto 20px;  
  }
  .contract p {text-align: center;}
  .contract .box {width: 100px; height: 40px;  padding: 8px; margin: 0 3px;}

  input[type="checkbox"] {
   	  transform: scale(1.8); /* 2배로 확대 */
  }	
  
  p label {
    margin-bottom: 5px; /* 라벨 아래쪽	 여백을 추가합니다. */
  }

  p input[type="checkbox"] {
    margin-right: 5px; /* 체크박스 오른쪽 여백을 추가하여 라벨과의 간격을 조절합니다. */
  }
  
  
  /* 회원가입페이지 최상단 h2요소 중앙배치 */
  .center {
    display: flex;
    justify-content: center;
    white-space: nowrap;
  }

  .breadcrumb{
    background-color: white;
  }

</style>
</head>
<body>

	<!-- 브레드크럼 css -->
  	<link rel="stylesheet" href="<%= request.getContextPath() %>/resources/css/breadcrumb.css">



	<div class="wrap">
	
	<!-- header start -->
	<%@ include file="/views/common/header.jsp" %>
	<!-- header end -->

    <!-- 브레드크럼 start -->
    <div class="breadc">
      <ol>
        <li><a href="<%= contextPath %>">Home</a></li> <!--홈화면으로 갈수있게-->
        <li class="separator">&gt</li>
        <li>회원가입</li>
      </ol>
    </div>
    <!-- 브레드크럼 end -->
        
    <!-- Section start -->
    <section class="main_content">
      
      <div class="signup_content">
        <div class="center">
          <h2>전자상거래(인터넷사이버몰) 표준약관</h2>
        </div>  
          
        <form class="contract" action="<%= contextPath %>/signupForm.me">
            
          <div class="text">제1조(목적) 이 약관은 포마이펫 회사(전자상거래 사업자)가 운영하는 포마이펫 사이버 몰(이하 “몰”이라 한다)에서 제공하는 인터넷 관련 서비스(이하 “서비스”라 한다)를 이용함에 있어 사이버 몰과 이용자의 권리․의무 및 책임사항을 규정함을 목적으로 합니다.

  ※「PC통신, 무선 등을 이용하는 전자상거래에 대해서도 그 성질에 반하지 않는 한 이 약관을 준용합니다.」

제2조(정의)

  ① “몰”이란 포마이펫 회사가 재화 또는 용역(이하 “재화 등”이라 함)을 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 재화 등을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 사이버몰을 운영하는 사업자의 의미로도 사용합니다.

  ② “이용자”란 “몰”에 접속하여 이 약관에 따라 “몰”이 제공하는 서비스를 받는 회원 및 비회원을 말합니다.

  ③ ‘회원’이라 함은 “몰”에 회원등록을 한 자로서, 계속적으로 “몰”이 제공하는 서비스를 이용할 수 있는 자를 말합니다.

  ④ ‘비회원’이라 함은 회원에 가입하지 않고 “몰”이 제공하는 서비스를 이용하는 자를 말합니다.

제3조 (약관 등의 명시와 설명 및 개정) 

  ① “몰”은 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호․모사전송번호․전자우편주소, 사업자등록번호, 통신판매업 신고번호, 개인정보관리책임자등을 이용자가 쉽게 알 수 있도록 00 사이버몰의 초기 서비스화면(전면)에 게시합니다.
    다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수 있습니다.

  ② “몰은 이용자가 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회․배송책임․환불조건 등과 같은 중요한 내용을 이용자가 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공하여 이용자의 확인을 구하여야 합니다.

  ③ “몰”은 「전자상거래 등에서의 소비자보호에 관한 법률」, 「약관의 규제에 관한 법률」, 「전자문서 및 전자거래기본법」, 「전자금융거래법」, 「전자서명법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「방문판매 등에 관한 법률」, 「소비자기본법」 등 관련 법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.

  ④ “몰”이 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 몰의 초기화면에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다.  이 경우 "몰“은 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표시합니다. 

  ⑤ “몰”이 약관을 개정할 경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만 이미 계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을 제3항에 의한 개정약관의 공지기간 내에 “몰”에 송신하여 “몰”의 동의를 받은 경우에는 개정약관 조항이 적용됩니다.

  ⑥ 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다.

제4조(서비스의 제공 및 변경) 

  ① “몰”은 다음과 같은 업무를 수행합니다.

    1. 재화 또는 용역에 대한 정보 제공 및 구매계약의 체결
    2. 구매계약이 체결된 재화 또는 용역의 배송
    3. 기타 “몰”이 정하는 업무
    ② “몰”은 재화 또는 용역의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공할 재화 또는 용역의 내용을 변경할 수 있습니다. 이 경우에는 변경된 재화 또는 용역의 내용 및 제공일자를 명시하여 현재의 재화 또는 용역의 내용을 게시한 곳에 즉시 공지합니다.

  ③ “몰”이 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화등의 품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를 이용자에게 통지 가능한 주소로 즉시 통지합니다.

  ④ 전항의 경우 “몰”은 이로 인하여 이용자가 입은 손해를 배상합니다. 다만, “몰”이 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.

제5조(서비스의 중단) 

  ① “몰”은 컴퓨터 등 정보통신설비의 보수점검․교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.

  ② “몰”은 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상합니다. 단, “몰”이 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.

  ③ 사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 “몰”은 제8조에 정한 방법으로 이용자에게 통지하고 당초 “몰”에서 제시한 조건에 따라 소비자에게 보상합니다. 다만, “몰”이 보상기준 등을 고지하지 아니한 경우에는 이용자들의 마일리지 또는 적립금 등을 “몰”에서 통용되는 통화가치에 상응하는 현물 또는 현금으로 이용자에게 지급합니다.

제6조(회원가입) 

  ① 이용자는 “몰”이 정한 가입 양식에 따라 회원정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.

  ② “몰”은 제1항과 같이 회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다.

    1. 가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원자격 상실 후 3년이 경과한 자로서 “몰”의 회원재가입 승낙을 얻은 경우에는 예외로 한다.
    
       2. 등록 내용에 허위, 기재누락, 오기가 있는 경우
    3. 기타 회원으로 등록하는 것이 “몰”의 기술상 현저히 지장이 있다고 판단되는 경우

  ③ 회원가입계약의 성립 시기는 “몰”의 승낙이 회원에게 도달한 시점으로 합니다.

  ④ 회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 “몰”에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 합니다.

제7조(회원 탈퇴 및 자격 상실 등) 

  ① 회원은 “몰”에 언제든지 탈퇴를 요청할 수 있으며 “몰”은 즉시 회원탈퇴를 처리합니다.

  ② 회원이 다음 각 호의 사유에 해당하는 경우, “몰”은 회원자격을 제한 및 정지시킬 수 있습니다.

    1. 가입 신청 시에 허위 내용을 등록한 경우
    2. “몰”을 이용하여 구입한 재화 등의 대금, 기타 “몰”이용에 관련하여 회원이 부담하는 채무를 기일에 지급하지 않는 경우
    3. 다른 사람의 “몰” 이용을 방해하거나 그 정보를 도용하는 등 전자상거래 질서를 위협하는 경우
    4. “몰”을 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우

  ③ “몰”이 회원 자격을 제한․정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우 “몰”은 회원자격을 상실시킬 수 있습니다.

  ④ “몰”이 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.

제8조(회원에 대한 통지)

  ① “몰”이 회원에 대한 통지를 하는 경우, 회원이 “몰”과 미리 약정하여 지정한 전자우편 주소로 할 수 있습니다.

  ② “몰”은 불특정다수 회원에 대한 통지의 경우 1주일이상 “몰” 게시판에  ......
    
            </div>

            <div>
              <p>
				<input type="checkbox" id="agree1" required>
				<label for="agree1">약관에 동의합니다.</label>
			  </p>
            </div>

            <br><br>

            <div class="center">
              <h2>개인정보취급(처리)방침</h2>
            </div>  

            <br>

            <div class="text">제1장 총칙

제1조 (목적)

이 약관은 포마이펫 (이하 “회사”라 합니다)가 제공하는 웹서비스 (이하 “서비스”라 합니다)의 이용조건 및 절차 등에 관한 사항을 규정함을 목적으로 합니다.

제2조 (약관의 효력 및 변경)
본 서비스를 이용하고자 하는 모든 이용자에 대하여 그 효력을 발생합니다.
이 약관의 내용은 서비스의 일부 화면 또는 기타 방법 등에 의하여 그 내용을 게재함으로써 그 효력을 발생합니다.
회사는 운영 또는 영업상 중요한 사유가 있을 경우 본 약관을 임의로 변경할 수 있으며, 변경된 약관은 본 조 제2항과 같은 방법으로 공지함으로써 그 효력을 발생합니다.

제 3조 (약관 외 준칙)
이 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법, 정보통신망이용촉진 등에 관한 법률 및 기타 관련법령, 회사가 별도로 정한 지침 등에 의합니다.

제 4조. 용어의 정의
(1) “이용자”라 함은 회사가 운영하는 웹사이트에 접속하여 본 약관에 따라 회사가 제공하는 서비스를 받는 자를 말합니다.
(2) “개인정보”라 함은 생존하는 이용자가 서비스 이용을 위해 제공한 개인에 관한 정보로서 당해 정보에 의하여 개인을 식별할 수 있는 정보(당해 정보만으로는 개인을 식별할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 정보를 포함)를 말합니다.


제 2장 서비스 이용 및 제한

제 5조 (서비스 이용)
(1) 이용자의 서비스 이용 신청은 본 약관에 대한 동의로 간주되며, 이용자가 그와 같이 서비스 이용을 신청한 때 본 약관에 따른 서비스 이용 계약이 성립됩니다. 단, 이용자는 언제든지 본 약관에 대한 동의를 철회할 수 있습니다.
(2) 서비스 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴를 원칙으로 합니다.
(3) 회사는 정보통신 시스템 등의 점검, 보수, 교체, 고장, 통신두절, 본 약관에 위배한 행위 등으로 인하여 정상적인 서비스 제공이 곤란한 경우 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
(4) 제3항에 의한 서비스 중단의 경우, 회사는 서비스화면을 통하여 관련 내용을 이용자에게 게시합니다. 단, 회사가 통제할 수 없는 사유로 인한 서비스 중단으로 서비스화면을 통한 게시가 불가능한 경우에는 그러하지 아니합니다.
(5) 회사에서 제공하는 서비스는 기본적으로 무료입니다. 단, 별도로 유료임을 명시한 서비스에 대해서는 그러하지 아니합니다.

제6조 서비스 이용 제한
(1) 회사는 다음 각 호에 경우에는 서비스를 제공하지 아니할 수 있습니다.
가. 이용자가 영리를 추구할 목적으로 서비스를 이용하고자 하는 경우
나. 이용자가 법령위반 또는 공공질서 내지 미풍양속을 저해할 목적으로 서비스 이용을 신청하였을 때
다. 이용자가 부정한 용도로 서비스를 이용하고자 하는 경우
라. 이용자가 본 약관에 규정된 제반 사항을 위반하거나 기타 이용자의 귀책사유로 이용승낙이 곤란한 경우


제7조 개인정보의 수집 및 이용 등
(1) 회사는 원칙적으로 이용자의 개인정보를 수집 및 이용하지 않습니다. 다만, 회사는 이용자의 원활한 사이트 접속을 위하여 인터넷 접속정보파일(이른바 쿠키정보)을 자동으로 수집하는 장치를 운영할 수 있으며, 이용자는 자신이 이용하는 컴퓨터의 설정을 변경함으로써 회사의 인터넷 접속정보파일의 수집을 차단할 수 있습니다.
(2) 회사가 이용자의 개인정보를 수집하는 때에는 반드시 해당 이용자의 동의를 받습니다.
(3) 이용자는 언제든지 회사가 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 회사는 이에 대해 지체 없이 필요한 조치를 취할 의무를 부담합니다.
(4) 기타 개인정보 관련 사항은 정보통신망 이용 촉진 및 정보보호 등에 관한 법률, 개인정보보호법 등 관련 법령 및 회사의 서비스 화면에 게시하는 개인정보 취급방침에 의합니다.

제8조 저작권의 귀속 및 이용제한
(1) 회사가 제공하는 저작물에 대한 저작권 기타 지적 재산권은 회사에 귀속합니다.
(2) 이용자는 회사가 제공하는 서비스를 이용함으로써 얻은 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.

제9조 서비스 이용중지
(1) 회사는 이용자가 다음 사항에 해당하는 행위를 하였을 경우, 상당한 기간을 정하여 서비스 이용을 중지할 수 있습니다.
가. 공공질서 내지 미풍양속에 반하는 행위를 한 경우
나. 범죄적 행위에 관련되는 경우
다. 국익 또는 사회적 공익을 저해할 목적으로 서비스 이용을 계획하거나 실행할 경우
라. 타인의 명예를 손상시키거나 불이익을 주는 경우
마. 서비스에 위해를 가하는 등 건전한 이용을 저해하는 경우
바. 기타 관련 법령이나 본 약관에 위배되는 경우

(2) 회사는 서비스 이용을 중지하고자 하는 경우 그 사유, 일시 및 기간을 정하여 서면 또는 전화 등의 방법을 이용하여 해당 이용자 또는 대리인에게 통지합니다. 다만, 회사가 긴급하게 이용을 중지해야 할 필요가 있다고 인정하는 경우에는 위 통지 없이 서비스 이용을 중지할 수 있습니다.

제10조 서비스 이용중지의 해제
(1) 전조의 규정에 의하여 서비스 이용중지를 통지 받은 이용자 또는 그 대리인은 서비스 이용중지에 대하여 이의 신청을 할 수 있습니다.
(2) 회사는 이용중지 사유가 해소된 것이 확인된 경우에 한하여 이용중지 조치를 즉시 해제합니다.


제3장 의무와 책임

제11조 회사의 의무
(1) 회사는 본 약관에서 정한 바에 따라 계속적, 안정적으로 서비스를 제공할 의무가 있습니다.
(2) 회사는 이용자로부터 소정의 절차에 의해 제기되는 의견에 대해서는 적절한 절차를 거쳐 처리하며, 그에 일정 기간이 소요될 경우 이용자에게 그 사유와 처리 일정을 알려주어야 합니다.

제12조 이용자의 의무
(1) 이용자는 본 약관 및 관계 법령에서 규정한 사항을 준수하여야 하며, 다음 행위를 하여서는 안됩니다.
가. 허위 정보를 등록하는 등 기타 부정한 수단의 이용
나. 회사가 운영하는 웹사이트에 게시된 정보의 임의적인 변경
다. 회사가 허락하지 않은 정보 등의 송신 또는 게시
라. 회사, 기타 제3자의 저작권 등 지적재산권에 대한 침해
마. 회사, 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
바. 외설 또는 폭력적인 메시지, 화상, 음성 기타 미풍양속에 반하는 정보를 공개 또는 게시하는 행위

제13조 손해배상
회사와 이용자는 서비스 이용과 관련하여 고의 또는 과실로 상대방에게 손해를 끼친 경우, 그 손해를 배상하여야 합니다. 단, 회사는 무료로 제공하는 서비스의 이용과 관련하여 개인정보 취급방침에서 정하는 내용에 위반하지 않는 한 어떠한 손해에 대하여도 책임을 지지 않습니다.

제14조 면책조항
(1) 회사는 천재지변 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우 서비스 제공에 관한 책임이 면제됩니다.
(2) 회사는 이용자의 귀책사유로 인한 서비스 이용 장애에 대하여는 책임을 지지 않습니다.
(3) 회사는 이용자가 서비스를 이용하여 기대하는 수익을 상실한 것이나 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 않습니다.
(4) 회사는 이용자가 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 관하여는 책임을 지지 않습니다.
(5) 회사는 서비스 이용과 관련하여 이용자에게 발생한 손해 가운데 이용자의 고의, 과실에 의한 손해에 대하여 책임을 지지 않습니다.
(6) 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 대한 책임이 면제됩니다.
(7) 회사는 이용자의 컴퓨터 오류에 의해 손해가 발생한 경우 또는 이용자가 서비스를 이용함에 있어 자신의 개인정보를 부실하게 기재하여 손해가 발생한 경우에 책임을 지지 않습니다.


제4장 일반사항

제15조 이용자의 게시물 관리
회사는 이용자가 게시하거나 등록한 내용물이 다음 사항에 해당된다고 판단되는 경우에 사전 통지 없이 삭제할 수 있습니다.
(1) 스팸(spam)성 게시물 등과 같이 회사에서 승인하지 아니한 광고, 판촉물을 게시하는 경우 및 서비스와 무관할 수 있는 내용인 경우
(2) 회사, 다른 이용자 또는 제3자의 명예를 손상시키는 비방 또는 중상모략일 수 있는 경우
(3) 공공질서 및 미풍양속에 위반되는 내용인 경우
(4) 범죄적 행위에 부합된다고 인정되는 내용인 경우
(5) 타인의 저작권 등 기타의 권리를 침해하는 내용인 경우
(6) 기타 관계 법령이나 본 약관에 위배되는 내용인 경우

제16조 이용자에 대한 통지 및 정보제공
(1) 회사는 불특정다수의 이용자에 대한 통지의 경우 1주일이상 게시판에 게시하는 방법으로 할 수 있습니다.

제17조 일부 무효
관련 법령 등에 의하여 본 약관의 일부 규정이 무효가 될 경우, 나머지 규정만으로 그 목적 달성이 불가능하거나 이용자에게 부당하게 불리하지 아니하는 이상 본 약관은 그 효력을 유지합니다.

제18조 재판관할 및 준거법
(1) 회사의 유료 서비스 이용 회원의 경우 당해 서비스와 관련하여서는 회사가 별도로 정한 약관 및 정책에 따릅니다.
(2) 서비스 이용과 관련하여 회사와 이용자 간에 발생하는 분쟁 관련 소송의 관할 법원은 민사소송법상의 관할을 가지는 대한민국 법원으로 하며, 준거법은 대한민국법으로 합니다.

(부칙)
본 약관은 2020년 2월 24일부터 적용됩니다.
          </div>

            <div>
              <p>
				<input type="checkbox" id="agree2" required>
				<label for="agree2">약관에 동의합니다.</label>
			  </p>

              <br><br><br>
			  <p>약관에 동의해야 가입을 진행 할 수 있습니다.</p>
              <p><button type="button" class="btn btn-outline-danger btn-sm" onclick="history.back();">뒤로가기</button>
              <input type="submit" class="btn btn-outline-secondary btn-sm" value="다음" class="box"></p>
      
            </div>
      
        </form>
      
      </div>
          



    </section>
    <!-- Section end -->
    
        
    <!-- footer start -->
	<%@ include file="/views/common/footer.jsp" %>
	<!-- footer end -->
	
	
	
	</div>
</body>
</html>